In [2]:
import pandas as pd

from data_clean import load_and_clean_data

df = load_and_clean_data("data.csv")

df

,id,name,gender,pictured,description,loan_amount,activity,sector,country,town,posted_date,repayment_term,languages,days_until_funded
0,350525,Jovita,F,1,Jovita continues participating with Asociación...,575,Agriculture,Agriculture,Peru,Anta - Anta - Cusco,2011-10-24 17:50:06+00:00,6,"[es, en]",0
1,138072,Mary,F,1,Mary is 42 years old and married with 4 childr...,525,Food Market,Food,Nigeria,"Sapele, Delta state",2009-09-18 11:30:12+00:00,10,[en],4
2,521248,Merlita,F,1,"Merlita is 39 years old, married, and blessed ...",125,Pigs,Agriculture,Philippines,"Bustamante, Luna, Isabela",2013-01-30 18:10:13+00:00,7,[en],0
3,199163,Kioko,M,1,Kioko is a 50-year-old man who is married with...,275,Cafe,Food,Kenya,Machakos,2010-05-07 11:20:04+00:00,14,[en],5
4,541831,Magnolia,F,1,"As a married parent of three children, Magnoli...",500,Fruits & Vegetables,Food,Philippines,"Kabankalan, Negros Occidental",2013-03-26 21:50:01+00:00,5,[en],0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,651489,Las Perlitas Group,F,1,The members belong to the Las Perlitas (Little...,4800,Fruits & Vegetables,Food,Peru,CUSCO,2013-12-27 22:40:09+00:00,6,"[es, en]",0
96,390188,Martina,F,1,Martina is a cheerful and hard-working woman. ...,750,Farming,Agriculture,Peru,Ayacucho,2012-02-13 21:00:03+00:00,12,"[es, en]",6
97,6227,Georgina,F,1,"Georgina is 53 years old, married with 2 child...",900,Fuel/Firewood,Retail,Ghana,"Effiakuma, Takoradi",2007-03-30 07:48:51+00:00,13,[en],0
98,618688,Mirian Del Socorro,F,1,Mirian del Socorro was born in Nagarote and is...,1025,Grocery Store,Food,Nicaragua,Leon,2013-10-10 18:20:12+00:00,8,"[es, en]",14
99,381457,Grace,F,1,Grace has been farming in her home area of Kit...,350,Poultry,Agriculture,Kenya,Kitale,2012-01-17 02:50:03+00:00,14,[en],0

In [ ]:
print("Shape of dataset:", df.shape)

print("\nData types:")
print(df.dtypes)

Shape of dataset: (100, 14)

Columns:
Index(['id', 'name', 'gender', 'pictured', 'description', 'loan_amount',
       'activity', 'sector', 'country', 'town', 'posted_date',
       'repayment_term', 'languages', 'days_until_funded'],
      dtype='object')

Data types:
id                                 int64
name                              object
gender                            object
pictured                           int64
description                       object
loan_amount                        int64
activity                          object
sector                            object
country                           object
town                              object
posted_date          datetime64[ns, UTC]
repayment_term                     int64
languages                         object
days_until_funded                  int64
dtype: object

In [4]:
df.describe(include='all')

,id,name,gender,pictured,description,loan_amount,activity,sector,country,town,posted_date,repayment_term,languages,days_until_funded
count,100.000000,100,100,100.00,100,100.000000,100,100,100,100,100,100.000000,100,100.000000
unique,NaN,95,2,NaN,100,NaN,47,12,32,87,NaN,NaN,4,NaN
top,NaN,Mary,F,NaN,Jovita continues participating with Asociación...,NaN,Retail,Food,Peru,CUSCO,NaN,NaN,[en],NaN
freq,NaN,2,80,NaN,1,NaN,8,31,19,5,NaN,NaN,59,NaN
mean,309262.410000,NaN,NaN,0.99,NaN,773.500000,NaN,NaN,NaN,NaN,2011-03-04 16:16:02.869999872+00:00,10.760000,NaN,3.110000
min,4056.000000,NaN,NaN,0.00,NaN,75.000000,NaN,NaN,NaN,NaN,2007-01-30 19:29:49+00:00,5.000000,NaN,0.000000
25%,142356.500000,NaN,NaN,1.00,NaN,275.000000,NaN,NaN,NaN,NaN,2009-10-08 05:45:16.500000+00:00,7.750000,NaN,0.000000
50%,302615.500000,NaN,NaN,1.00,NaN,500.000000,NaN,NaN,NaN,NaN,2011-05-30 21:20:03.500000+00:00,10.000000,NaN,1.000000
75%,456613.000000,NaN,NaN,1.00,NaN,931.250000,NaN,NaN,NaN,NaN,2012-08-02 20:50:01.249999872+00:00,14.000000,NaN,3.000000
max,673800.000000,NaN,NaN,1.00,NaN,4800.000000,NaN,NaN,NaN,NaN,2014-02-26 00:10:02+00:00,27.000000,NaN,29.000000
std,187760.017709,NaN,NaN,0.10,NaN,898.650925,NaN,NaN,NaN,NaN,NaN,4.320774,NaN,6.028376

# Takeaways of Five Findings:

1. Gender Distribution: Gender highly skewed toward female. Female (F) = 80% / Male (M) = 20%

2. Loan Amount: Loan amount distribution is right-skewed. The average value is significantly higher than the median, indicating that there is a large amount of high-value loans that have pushed up the average.

3. Repayment Term: The repayment term for most loans is between 8 and 14 months. Repayment term shows wide dispersion.

4. Sectors / Activities: 'Agriculture' and 'Food' are the most common sector categories.

5. Missing Values: The languages ​​column has a large number of missing values, which need to be handled during analysis.